package lesson3_StackAndQueue.HomeWork;


/*

 */

/*
1. Дан массив из n элементов, начиная с 1. Каждый следующий элемент равен (предыдущий + 1). Но в массиве гарантированно 1 число пропущено.
Необходимо вывести на экран пропущенное число.
Примеры:
[1, 2 ,3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16] => 11
[1, 2, 4, 5, 6] => 3
[2, 3, 4, 5, 6, 7, 8] => 1
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14] => 15
[] => 1

(дополнительно). 2. Закольцевать очередь, чтобы после извлечения элементов пустые ячейки переиспользовались
 */
public class Main {
    public static void main(String[] args) {
        MyArray.isRepeat = false;
        MyArray.isShuffle = false;
        final int SIZE = 1000;
        Integer[] arr = MyArray.getArray(SIZE, 2);

        final int NUM2FIND = 50000;

    }
}
